In [1]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

print(df['A'])
print(df['B'])

a    1
b    4
Name: A, dtype: int64
a    2
b    5
Name: B, dtype: int64

In [2]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

print(df[['A', 'B']])
print(df[['A', 'C']])

   A  B
a  1  2
b  4  5
   A  C
a  1  3
b  4  6

In [3]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

print(df[0:1])
print(df[0:2])

   A  B  C
a  1  2  3
   A  B  C
a  1  2  3
b  4  5  6

In [4]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

print(df.loc['a', 'A']) # 1
print(df.loc['a', ['A', 'B']])
print(df.loc[['a', 'b'], 'A'])
print(df.loc[['a', 'b'], ['A', 'B']])

1
A    1
B    2
Name: a, dtype: int64
a    1
b    4
Name: A, dtype: int64
   A  B
a  1  2
b  4  5

In [15]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['a', 'b'], columns=['A', 'B', 'C'])

print(df.iloc[0, 0]) # 1
print(df.iloc[0, [0, 1]])
print(df.iloc[[0, 1], 0])
print(df.iloc[[0, 1], [0, 1]])

1
A    1
B    2
Name: a, dtype: int64
a    1
b    4
Name: A, dtype: int64
   A  B
a  1  2
b  4  5

In [8]:
print(df.loc['a', 'A'])
print(df.loc)
# <pandas.core.indexing._LocIndexer object at 0x7f236192f770>
print(type(df.loc))
# <class 'pandas.core.indexing._LocIndexer'>

1
<pandas.core.indexing._LocIndexer object at 0x11e51c4d0>
<class 'pandas.core.indexing._LocIndexer'>

In [9]:
df.loc('a', 'A')
Traceback (most recent call last):
  ...
TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

SyntaxError: invalid syntax (<ipython-input-9-726f6bd2df8a>, line 2)

In [10]:
print(df.loc['a', 'A']) # 1
print(df.iloc[0, 1]) # 2

1
2

In [11]:
print(df.at['a', 'A']) # 1
print(df.iat[0, 1]) # 2

1
2

In [12]:
print(df > 2)
#        A      B     C
# a  False  False  True
# b   True   True  True

print(df[df > 2])
#      A    B  C
# a  NaN  NaN  3
# b  4.0  5.0  6

       A      B     C
a  False  False  True
b   True   True  True
     A    B  C
a  NaN  NaN  3
b  4.0  5.0  6

In [13]:
print(df['A'] > 2)
# a    False
# b     True
# Name: A, dtype: bool

print(df[df['A'] > 2])
#    A  B  C
# b  4  5  6

a    False
b     True
Name: A, dtype: bool
   A  B  C
b  4  5  6

2. 請根據提供的資料，選擇出下列的要求：

In [17]:
import pandas as pd
import numpy as np

In [18]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -0.613607  0.560731 -0.225789
1 -0.216136 -0.541898 -0.151239
2  0.306881  0.569775 -1.152937
3 -1.033131  0.390247 -0.796763
4 -1.516628 -1.248853 -0.307112
5 -1.240032 -1.511635  0.558668

In [34]:
df.iloc[0:4]

    0   1   2   3
0  37  20  33  11
1  24  15  35  29
2  16  27  38  29
3  26  37  10  11

In [31]:
df.iloc[4:6]

    0   1   2   3
4  38  24  13  24
5  13  25  25  26

In [23]:
#df.iloc[:,[len(df.iloc[0])-2, len(df.iloc[0])-1]]
df.iloc[:,-2:]

       col2      col3
0  0.560731 -0.225789
1 -0.541898 -0.151239
2  0.569775 -1.152937
3  0.390247 -0.796763
4 -1.248853 -0.307112
5 -1.511635  0.558668

In [24]:
#df.iloc[0: len(df): 2]
df.iloc[0:: 2]

       col1      col2      col3
0 -0.613607  0.560731 -0.225789
2  0.306881  0.569775 -1.152937
4 -1.516628 -1.248853 -0.307112

3. 請根據提供的資料，選擇出下列的要求：

In [25]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   37  20  33  11
1   24  15  35  29
2   16  27  38  29
3   26  37  10  11
4   38  24  13  24
5   13  25  25  26
6   26  23  31  16
7   22  17  30  33
8   20  30  22  13
9   33  17  12  13
10  34  23  36  10
11  12  30  18  20
12  31  15  35  39
13  11  14  23  29
14  37  35  11  19

In [26]:
df[df[0] + df[1] > 50]

     0   1   2   3
0   37  20  33  11
3   26  37  10  11
4   38  24  13  24
10  34  23  36  10
14  37  35  11  19

In [27]:
df[(df[0]<30) | (df[1]>30)]

     0   1   2   3
1   24  15  35  29
2   16  27  38  29
3   26  37  10  11
5   13  25  25  26
6   26  23  31  16
7   22  17  30  33
8   20  30  22  13
11  12  30  18  20
13  11  14  23  29
14  37  35  11  19

In [28]:
df[df.sum(axis=1) > 100]

     0   1   2   3
0   37  20  33  11
1   24  15  35  29
2   16  27  38  29
7   22  17  30  33
10  34  23  36  10
12  31  15  35  39
14  37  35  11  19